In [1]:
import pandas as pd

In [2]:
data=pd.read_csv(r"C:\Users\surface\Downloads\BlueOrRed.csv")

In [3]:
data

,Undecided,Age,HomeOwner,Female,Married,HouseholdSize,Income,Education,Church
0,1,51,1,1,1,4,171.0,15,0
1,1,37,1,1,1,3,96.0,18,0
2,1,53,1,1,1,6,86.0,20,0
3,0,33,1,1,1,2,176.0,18,1
4,0,46,1,1,1,6,420.0,15,1
...,...,...,...,...,...,...,...,...,...
9995,0,27,1,1,0,1,140.5,12,0
9996,0,32,1,1,1,2,79.0,11,1
9997,0,35,0,1,0,1,15.0,8,1
9998,0,26,0,0,0,5,5.0,11,1
9999,0,26,0,1,1,2,6.0,8,0

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
Undecided        10000 non-null int64
Age              10000 non-null int64
HomeOwner        10000 non-null int64
Female           10000 non-null int64
Married          10000 non-null int64
HouseholdSize    10000 non-null int64
Income           10000 non-null float64
Education        10000 non-null int64
Church           10000 non-null int64
dtypes: float64(1), int64(8)
memory usage: 703.2 KB

In [4]:
from sklearn.model_selection import train_test_split

In [8]:
X=data.iloc[:,1:5]

In [9]:
X

      Age  HomeOwner  Female  Married
0      51          1       1        1
1      37          1       1        1
2      53          1       1        1
3      33          1       1        1
4      46          1       1        1
...   ...        ...     ...      ...
9995   27          1       1        0
9996   32          1       1        1
9997   35          0       1        0
9998   26          0       0        0
9999   26          0       1        1

[10000 rows x 4 columns]

In [10]:
Y=data.iloc[:,0:1]

In [11]:
Y

      Undecided
0             1
1             1
2             1
3             0
4             0
...         ...
9995          0
9996          0
9997          0
9998          0
9999          0

[10000 rows x 1 columns]

In [12]:
train_X,test_X,train_Y,test_Y=train_test_split(X,Y,test_size=0.3)

In [13]:
train_X

      Age  HomeOwner  Female  Married
6338   52          1       1        1
1099   33          1       1        1
8360   40          1       1        0
6797   62          1       1        1
9518   35          1       1        1
...   ...        ...     ...      ...
3      33          1       1        1
3790   54          0       1        1
2749   46          1       1        1
1684   32          0       0        1
864    51          1       1        1

[7000 rows x 4 columns]

In [14]:
train_Y

      Undecided
6338          1
1099          1
8360          0
6797          0
9518          0
...         ...
3             0
3790          1
2749          0
1684          0
864           1

[7000 rows x 1 columns]

In [15]:
from sklearn.linear_model import LogisticRegression

In [16]:
jack=LogisticRegression()

In [17]:
jack.fit(train_X,train_Y)

C:\Users\surface\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
C:\Users\surface\Anaconda3\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [18]:
jack.predict(test_X)

array([0, 1, 0, ..., 0, 0, 0], dtype=int64)

In [20]:
Y_pred=jack.predict(test_X)

In [21]:
Y_pred

array([0, 1, 0, ..., 0, 0, 0], dtype=int64)

In [22]:
from sklearn.metrics import classification_report

In [23]:
classification_report(test_Y,Y_pred)

'              precision    recall  f1-score   support\n\n           0       0.63      0.87      0.73      1802\n           1       0.55      0.23      0.33      1198\n\n    accuracy                           0.62      3000\n   macro avg       0.59      0.55      0.53      3000\nweighted avg       0.60      0.62      0.57      3000\n'

In [24]:
print(classification_report(test_Y,Y_pred))

              precision    recall  f1-score   support

           0       0.63      0.87      0.73      1802
           1       0.55      0.23      0.33      1198

    accuracy                           0.62      3000
   macro avg       0.59      0.55      0.53      3000
weighted avg       0.60      0.62      0.57      3000

In [25]:
from sklearn.metrics import accuracy_score

In [26]:
accuracy_score(test_Y,Y_pred)

0.6173333333333333